<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [

  // +----------------------------------------------------------------------
  // | 缓存设置
  // +----------------------------------------------------------------------

  'cache'                  => [
      // 驱动方式
      'type'   => 'complex',
      // 默认使用的缓存
      'default'   =>  [
          // 驱动方式
          'type'   => 'File',
          // 缓存保存目录
          'path'   => CACHE_PATH,
      ],
      // 文件缓存
      'file'   =>  [
          // 驱动方式
          'type'   => 'file',
          // 设置不同的缓存保存目录
          'path'   => RUNTIME_PATH . 'file/',
      ],
      // redis缓存
      'redis'   =>  [
          // 驱动方式
          'type'   => 'redis',
          // 服务器地址
          'host'       => '127.0.0.1',
      ],
  ],

];
